- 1. Display the first 5 rows of the table.
- 2. Display the last 3 rows of the table.
- 3. Show information about the data types of each column.
- 4. Find the average age of employees.
- 5. Determine the maximum salary among all employees.
- 6. Find the minimum start date.
- 7. Display the names of employees in the IT department.
- 8. Sort the table by salary in descending order.
- 9. Display all employees with a salary above 70000.
- 10. Count the number of employees in each department.
- 11. Find the average salary of employees in the HR department.
- 12. Determine the number of employees older than 30 years.
- 13. Find the name of the employee with the earliest start date.
- 14. Add a new column with the number of years of work based on the StartDate column.
- 15. Display employees who started working in 2017.
- 16. Find the employee with the highest salary.
- 17. Determine the average length of work (in years) of employees.
- 18. Display a list of departments where employees work, without repetition.
- 19. Determine the average age of employees in each department.
- 20. Find the employee with the longest work experience.
- 21. Display a list of unique years in which employees started working.
- 22. Find employees with the maximum and minimum age.
- 23. Determine the ratio of the average salary of male employees to the average salary of female employees (if such data are available).
- 24. Calculate the number of employees working in each department who are under 35 years old.
- 25. Find employees whose last names begin with "S".
- 26. Output the average age of employees who started working after 2016.
- 27. Identify the most common department.
- 28. Count the number of employees whose names consist of two words.
- 29. Find the average age of employees who started working before 2018.

In [21]:
import pandas as pd
from datetime import datetime
de = pd.read_csv("employee_exc_3.csv")
de

   EmployeeID        Name  Age Department  Salary   StartDate
0           1  John Smith   28         HR   50000  2019-01-15
1           2    Jane Doe   34         IT   75000  2018-05-23
2           3   Sam Brown   45         IT   80000  2015-08-01
3           4    Lisa Ray   29         HR   52000  2020-10-12
4           5  Mark Green   40      Sales   65000  2017-03-11
5           6  Anna White   32         IT   72000  2016-04-20
6           7   Tom Black   38      Sales   68000  2017-09-30

In [22]:
de.head(5)

   EmployeeID        Name  Age Department  Salary   StartDate
0           1  John Smith   28         HR   50000  2019-01-15
1           2    Jane Doe   34         IT   75000  2018-05-23
2           3   Sam Brown   45         IT   80000  2015-08-01
3           4    Lisa Ray   29         HR   52000  2020-10-12
4           5  Mark Green   40      Sales   65000  2017-03-11

In [23]:
de.tail(3)

   EmployeeID        Name  Age Department  Salary   StartDate
4           5  Mark Green   40      Sales   65000  2017-03-11
5           6  Anna White   32         IT   72000  2016-04-20
6           7   Tom Black   38      Sales   68000  2017-09-30

In [24]:
de.dtypes

EmployeeID     int64
Name          object
Age            int64
Department    object
Salary         int64
StartDate     object
dtype: object

In [25]:
de["Age"].mean()

35.142857142857146

In [26]:
de["Salary"].max()

80000

In [27]:
de["StartDate"].min()

'2015-08-01'

In [28]:
de[de["Department"] == "IT"]["Name"]

1      Jane Doe
2     Sam Brown
5    Anna White
Name: Name, dtype: object

In [29]:
de.sort_values(by="Salary")

   EmployeeID        Name  Age Department  Salary   StartDate
0           1  John Smith   28         HR   50000  2019-01-15
3           4    Lisa Ray   29         HR   52000  2020-10-12
4           5  Mark Green   40      Sales   65000  2017-03-11
6           7   Tom Black   38      Sales   68000  2017-09-30
5           6  Anna White   32         IT   72000  2016-04-20
1           2    Jane Doe   34         IT   75000  2018-05-23
2           3   Sam Brown   45         IT   80000  2015-08-01

In [30]:
de[de["Salary"] > 70000]

   EmployeeID        Name  Age Department  Salary   StartDate
1           2    Jane Doe   34         IT   75000  2018-05-23
2           3   Sam Brown   45         IT   80000  2015-08-01
5           6  Anna White   32         IT   72000  2016-04-20

In [31]:
de.groupby(["Department"]).size()

Department
HR       2
IT       3
Sales    2
dtype: int64

In [32]:
de[de["Department"] == "HR"]["Salary"].mean()

51000.0

In [33]:
len(de[de["Age"] > 30])

5

In [34]:
de[de["StartDate"] == min(de["StartDate"])]["Name"]

2    Sam Brown
Name: Name, dtype: object

In [35]:
de["StartDate"] = pd.to_datetime(de["StartDate"]) # преобразовываем текущую дату в datetime что бы иметь возможность отнимать от формата текущей даты
today = datetime.today()
de["YearsOfWork"] = (today - de["StartDate"]).dt.days // 365 # выявляем только года и округляем до 2 знаков после запятой
de

   EmployeeID        Name  Age Department  Salary  StartDate  YearsOfWork
0           1  John Smith   28         HR   50000 2019-01-15            5
1           2    Jane Doe   34         IT   75000 2018-05-23            6
2           3   Sam Brown   45         IT   80000 2015-08-01            8
3           4    Lisa Ray   29         HR   52000 2020-10-12            3
4           5  Mark Green   40      Sales   65000 2017-03-11            7
5           6  Anna White   32         IT   72000 2016-04-20            8
6           7   Tom Black   38      Sales   68000 2017-09-30            6

In [36]:
de[de["StartDate"].dt.year == 2017] # выбираем только год

   EmployeeID        Name  Age Department  Salary  StartDate  YearsOfWork
4           5  Mark Green   40      Sales   65000 2017-03-11            7
6           7   Tom Black   38      Sales   68000 2017-09-30            6

In [37]:
de[de["Salary"] == max(de["Salary"])]["Name"]

2    Sam Brown
Name: Name, dtype: object

In [38]:
de["Department"].unique()

array(['HR', 'IT', 'Sales'], dtype=object)

In [39]:
de.groupby("Department")["Age"].mean()

Department
HR       28.5
IT       37.0
Sales    39.0
Name: Age, dtype: float64

In [92]:
min(de.groupby("StartDate")["Name"])

(Timestamp('2015-08-01 00:00:00'),
 2    Sam Brown
 Name: Name, dtype: object)

In [61]:
de["StartDate"].dt.year.unique().tolist()

[2019, 2018, 2015, 2020, 2017, 2016]

In [65]:
max(de["Age"])

45

In [64]:
min(de["Age"])

28

In [67]:
de["Gender"] = ["Male", "Female", "Male", "Female", "Male", "Female", "Male"] # добавляем новую колонку

,EmployeeID,Name,Age,Department,Salary,StartDate,YearsOfWork,Gender
0,1,John Smith,28,HR,50000,2019-01-15,5,Male
1,2,Jane Doe,34,IT,75000,2018-05-23,6,Female
2,3,Sam Brown,45,IT,80000,2015-08-01,8,Male
3,4,Lisa Ray,29,HR,52000,2020-10-12,3,Female
4,5,Mark Green,40,Sales,65000,2017-03-11,7,Male
5,6,Anna White,32,IT,72000,2016-04-20,8,Female
6,7,Tom Black,38,Sales,68000,2017-09-30,6,Male

In [80]:
m = de[de["Gender"] == "Male"]["Salary"].mean()
f = de[de["Gender"] == "Female"]["Salary"].mean()
res = m / f
res

Average Salary (Male): 65750.0
Average Salary (Male): 66333.33333333333

In [93]:
de[de["Age"] == min(de["Age"])]

,EmployeeID,Name,Age,Department,Salary,StartDate,YearsOfWork,Gender
0,1,John Smith,28,HR,50000,2019-01-15,5,Male

In [94]:
de[de["Age"] == max(de["Age"])]

,EmployeeID,Name,Age,Department,Salary,StartDate,YearsOfWork,Gender
2,3,Sam Brown,45,IT,80000,2015-08-01,8,Male

In [119]:
r = de[de["Age"] < 35]
r["Department"].value_counts()

Department
HR    2
IT    2
Name: count, dtype: int64

In [124]:
de[de["Name"].str.split().str[-1].str.startswith("S")]

,EmployeeID,Name,Age,Department,Salary,StartDate,YearsOfWork,Gender
0,1,John Smith,28,HR,50000,2019-01-15,5,Male

In [127]:
de[de["StartDate"].dt.year > 2016]["Age"].mean()

33.8

In [135]:
de.groupby("Department").size()

Department
HR       2
IT       3
Sales    2
dtype: int64

In [152]:
len(de[de["Name"].apply(lambda x: len(x.split()) == 2)])

7

In [160]:
de[de["StartDate"].dt.year < 2018]["Age"].mean()

38.75